# Mod. 2, Lab 10 - Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [2]:
import pandas as pd
import numpy as np
import math
from scipy import stats

# Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [3]:
temp=pd.read_csv('Temp_States.csv', sep=',')

#### Print `temp`.

In [4]:
print(temp)

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [5]:
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   City         7 non-null      object
 1   State        7 non-null      object
 2   Temperature  7 non-null      float64
dtypes: float64(1), object(2)
memory usage: 296.0+ bytes

`'City'` and `'State'` columns are string (objects) and `'Temperature'` is float.

#### Select the rows where state is New York.

In [6]:
ny = temp.loc[temp['State'] == 'New York']
ny

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [7]:
ny_temp = temp.loc[temp['State'] == 'New York', 'Temperature'].mean()
ny_temp

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [8]:
temp_above_15 = temp.loc[temp['Temperature'] > 15]
temp_above_15

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [9]:
temp_above_15 = temp.loc[temp['Temperature'] > 15, 'City']
temp_above_15

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [10]:
temp_15_20 = temp.loc[(temp['Temperature'] > 15) & (temp['Temperature'] < 20), 'City']
temp_15_20

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [11]:
state_temp = temp.groupby('State').mean()
state_temp

             Temperature
State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741

#  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [14]:
employees = pd.read_csv('Employees.csv', sep=',')
employees

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
3        Admin    Master         VP  Manuella     15      33
4        Sales    Master    Analyst     Carla      6      38
..         ...       ...        ...       ...    ...     ...
495      Sales       PhD         VP    Calvin      2     119
496         HR    Master    Analyst    Dustin      6      67
497      Sales       PhD         VP   Winston     13      93
498         IT       PhD    Analyst      Earl     12     108
499      Sales    Master    Analyst     Alvin     13      48

[500 rows x 6 columns]

#### Explore the data types of the `employees` dataframe. Comment your results.

In [16]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Department  500 non-null    object
 1   Education   500 non-null    object
 2   Title       500 non-null    object
 3   Name        500 non-null    object
 4   Years       500 non-null    int64
 5   Salary      500 non-null    int64
dtypes: int64(2), object(4)
memory usage: 23.6+ KB

In [17]:
'''
4 categorical columns (Dept / Education / Title / Name) and 2 numerical (years / salary)

'''

'\n4 categorical columns (department / )\n'

#### What's the average salary in this company?

In [20]:
employees['Salary'].mean()

73.528

In [21]:
employees.describe()

            Years      Salary
count  500.000000  500.000000
mean     7.556000   73.528000
std      4.465731   26.890061
min      1.000000   30.000000
25%      3.000000   50.000000
50%      7.000000   72.000000
75%     11.250000   97.000000
max     15.000000  120.000000

#### What's the highest salary?

In [15]:
#120 (see descibe above, or max below)

In [24]:
employees['Salary'].max()

120

#### What's the lowest salary?

In [16]:
#30 (see desrcibe above, or min() below)

In [25]:
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [31]:
employees.loc[employees['Salary'] == employees['Salary'].min()]

    Department Education      Title      Name  Years  Salary
27          IT  Bachelor    Analyst      Sean     12      30
106      Admin  Bachelor  associate      Luke      4      30
128      Sales       PhD         VP      Adam      8      30
139      Sales       PhD    Analyst      Rick     11      30
214      Sales    Master         VP      Neil     11      30
266         HR       PhD  associate    Marcel     10      30
452         IT  Bachelor    Analyst  Augustin     13      30

In [32]:
#or if we only want their names:

employees['Name'].loc[employees['Salary'] == employees['Salary'].min()]

27         Sean
106        Luke
128        Adam
139        Rick
214        Neil
266      Marcel
452    Augustin
Name: Name, dtype: object

#### Find all the information about an employee called David.

In [33]:
employees.loc[employees['Name'] == 'David']

    Department Education      Title   Name  Years  Salary
0        Admin    Master  associate  David      4      58
124         IT  Bachelor         VP  David      3      31

#### Could you return only David's salary?

In [34]:
#Do you mean from Admin or David from IT?

employees['Salary'].loc[employees['Name'] == 'David']

0      58
124    31
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [39]:
employees.loc[employees['Title'].str.lower() == 'associate']

#just adding .str.lower() in case there had been any capitalized 'Associate' (there actually isn't any of them)

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
7           HR    Master  associate     Carol     14      53
8        Admin       PhD  associate      Jean      8      50
..         ...       ...        ...       ...    ...     ...
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
491      Admin       PhD  associate     Alice      8      37
494      Sales  Bachelor  associate   Vanessa     11     118

[158 rows x 6 columns]

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [40]:
employees.head(3)

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

In [49]:
employees.iloc[[0,1,2]]

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

In [51]:
#or
employees.iloc[0:3]

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

#### Find the employees whose title is associate and whose salary is above 55.

In [53]:
employees.loc[(employees['Title'] == 'associate') & (employees['Salary'] > 55)]

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
9        Admin    Master  associate    Kareem      3     104
10       Admin    Master  associate   Cynthia      1     114
16       Admin  Bachelor  associate    Shanon      1      99
18       Admin  Bachelor  associate     Megan      9      79
..         ...       ...        ...       ...    ...     ...
476      Admin       PhD  associate      Greg      8      93
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
494      Sales  Bachelor  associate   Vanessa     11     118

[104 rows x 6 columns]

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [55]:
employees.groupby('Years').mean()

          Salary
Years
1      75.863636
2      75.857143
3      74.571429
4      77.129032
5      73.857143
6      72.382353
7      73.840000
8      64.250000
9      76.741935
10     73.351351
11     74.866667
12     73.454545
13     71.935484
14     70.968750
15     69.758621

####  What is the average salary per title?

In [59]:
employees.groupby('Title')['Salary'].mean()

Title
Analyst      73.703911
VP           72.907975
associate    73.968354
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [26]:
#50, 72, 97 (see employees.describe above)

#### Is the mean salary different per gender?

In [27]:
# We could compute employees.groupby('Gender')['Salary'].mean() IF THERE WAS A GENDER COLUMN!
# (don't expect us to assume gender by first names :-) )

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [125]:
#Best way to display the info in the order and format that I want:
 
summary = pd.concat([employees.groupby('Department')['Years'].min().rename('Years Min'),
                     employees.groupby('Department')['Years'].mean().round().astype(int).rename('Years Avg'),
                     employees.groupby('Department')['Years'].max().rename('Years Max'),
                     employees.groupby('Department')['Salary'].min().rename('Salary Min'),
                     employees.groupby('Department')['Salary'].mean().round(2).rename('Salary Avg'),
                     employees.groupby('Department')['Salary'].max().rename('Salary Max')],
                     axis=1)
summary

,Years Min,Years Avg,Years Max,Salary Min,Salary Avg,Salary Max
Department,,,,,,
Admin,1,8,15,30,76.33,120
HR,1,7,15,30,74.24,119
IT,1,8,15,30,70.67,120
Sales,1,7,15,30,73.13,120

In [106]:
#or trying out more efficient ways of getting the same info:
#use the describe methods and keep only min mean max columns:

employees.groupby('Department').describe().loc[:, (slice(None), ['min', 'mean', 'max'])]

           Years Salary     Years     Salary Years Salary
             min    min      mean       mean   max    max
Department
Admin        1.0   30.0  7.642276  76.325203  15.0  120.0
HR           1.0   30.0  7.172131  74.237705  15.0  119.0
IT           1.0   30.0  8.141791  70.671642  15.0  120.0
Sales        1.0   30.0  7.206612  73.132231  15.0  120.0

In [104]:
employees.groupby('Department').agg({'Years': ['min', 'mean', 'max'], 'Salary': ['min', 'mean', 'max']})

           Years               Salary
             min      mean max    min       mean  max
Department
Admin          1  7.642276  15     30  76.325203  120
HR             1  7.172131  15     30  74.237705  119
IT             1  8.141791  15     30  70.671642  120
Sales          1  7.206612  15     30  73.132231  120

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [135]:
employees.groupby('Department').agg({'Salary': lambda x: (max(x) - min(x))}).rename(columns={'Salary': 'Salary range'})

            Salary range
Department
Admin                 90
HR                    89
IT                    90
Sales                 90

# Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [30]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [31]:
# your code here

In [32]:
"""
your comments here
"""

'\nyour comments here\n'

####  What is the average purchase price?

In [33]:
# your code here

#### What are the highest and lowest purchase prices?

In [34]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [35]:
# your code here

#### How many customers do we have in Spain?

In [36]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [37]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [38]:
# your code here

#### Select all free orders.

In [39]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [40]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [41]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [42]:
# your code here

#### Select all orders made in the month of August.

In [43]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [44]:
# your code here

#### What's the  average amount of money spent by country?

In [45]:
# your code here

#### What's the most expensive item?

In [46]:
# your code here

#### What is the average amount spent per year?

In [47]:
# your code here